Importing from the web

In [1]:
import numpy as np
import pandas as pd

In [2]:
red_wine = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv", sep = ";")

In [3]:
white_wine = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-white.csv",sep = ";")

In [4]:
wine = red_wine.append(white_wine,ignore_index=True)

In [5]:
wine

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
...,...,...,...,...,...,...,...,...,...,...,...,...
6492,6.2,0.21,0.29,1.6,0.039,24.0,92.0,0.99114,3.27,0.50,11.2,6
6493,6.6,0.32,0.36,8.0,0.047,57.0,168.0,0.99490,3.15,0.46,9.6,5
6494,6.5,0.24,0.19,1.2,0.041,30.0,111.0,0.99254,2.99,0.46,9.4,6
6495,5.5,0.29,0.30,1.1,0.022,20.0,110.0,0.98869,3.34,0.38,12.8,7
6496,6.0,0.21,0.38,0.8,0.020,22.0,98.0,0.98941,3.26,0.32,11.8,6

In [6]:
x = "I love Machine Learning and Deep Learning"

In [7]:
x = np.array(x.split())

In [8]:
list(x)

['I', 'love', 'Machine', 'Learning', 'and', 'Deep', 'Learning']

In [9]:
pd.Series(x,index=np.arange(10,17))

10           I
11        love
12     Machine
13    Learning
14         and
15        Deep
16    Learning
dtype: object

In [10]:
##starts from index 10, we can start from ascii characters like letters a,b A,B

In [11]:
import string

In [12]:
data = list(string.ascii_letters+string.digits)

In [13]:
data

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z',
 'A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z',
 '0',
 '1',
 '2',
 '3',
 '4',
 '5',
 '6',
 '7',
 '8',
 '9']

In [14]:
x = pd.Series(x, index=data[26:len(x)+26])

In [15]:
x

A           I
B        love
C     Machine
D    Learning
E         and
F        Deep
G    Learning
dtype: object

In [16]:
len(x)

7

In [17]:
len(x)+26

33

In [18]:
data[26:len(x)+26]

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [19]:
data[26:33]

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [20]:
#generate DataFrame from  scratch

In [21]:
df = pd.DataFrame(list(x),columns = ['Name'])

In [22]:
df[["Name"]]

       Name
0         I
1      love
2   Machine
3  Learning
4       and
5      Deep
6  Learning

In [23]:
#Add columns

In [24]:
df["Age"] = [22,11,22,33,44,55,22]

In [25]:
df

       Name  Age
0         I   22
1      love   11
2   Machine   22
3  Learning   33
4       and   44
5      Deep   55
6  Learning   22

In [26]:
df["Age"].values

array([22, 11, 22, 33, 44, 55, 22], dtype=int64)

In [37]:
df1 = pd.read_csv("Demo.csv",header = None,names=["Name","Age","Marks","Gender"])

In [42]:
df1 = df1[1:]

In [43]:
df1[["Name"]]

  Name
1    A
2    B
3    C
4    D
5    E

In [44]:
df1[df1.Gender == "Male"]

  Name Age Marks Gender
1    A  21    56   Male
4    D  25    90   Male
5    E  45    82   Male

In [45]:
df1[["Name","Marks"]]

  Name Marks
1    A    56
2    B    78
3    C    54
4    D    90
5    E    82